tutorials/Lagrangian/rhoPisoTwinParcelFoam/simplifiedSiwek/constant/kinematicCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kinematicCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

InjectionModel  ManualInjection;

DragModel       SphereDrag;

DispersionModel StochasticDispersionRAS;

WallInteractionModel StandardWallInteraction;

minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;

rho0            rho0 [ 1 -3 0 0 0 ] 5000;

coupled         true;

parcelTypeId    2;

interpolationSchemes
{
    rho             cell;
    U               cellPointFace;
    mu              cell;
}

integrationSchemes
{
    U               Euler;
}

ManualInjectionCoeffs
{
    parcelBasisType mass;
    massTotal       massTotal [ 1 0 0 0 0 ] 0.0002;
    SOI             0;
    positionsFile   kinematicCloud1Positions;
    U0              ( 0 0 0 );
    parcelPDF
    {
        pdfType         RosinRammler;
        RosinRammlerPDF
        {
            minValue        5e-05;
            maxValue        0.0001;
            d               ( 7.5e-05 );
            n               ( 0.5 );
        }
    }
}

ConeInjectionCoeffs
{
    SOI             0.001;
    duration        0.005;
    position        ( 0.25 0.25 0.05 );
    direction       ( 0 -1 0 );
    parcelsPerSecond 10000;
    volumeFlowRate  Constant;
    volumeFlowRateCoeffs
    {
        value           0.01;
    }

    Umag            Constant;
    UmagCoeffs
    {
        value           50;
    }

    thetaInner      Constant;
    thetaInnerCoeffs
    {
        value           0;
    }

    thetaOuter      Constant;
    thetaOuterCoeffs
    {
        value           30;
    }

    parcelPDF
    {
        pdfType         RosinRammler;
        RosinRammlerPDF
        {
            minValue        5e-05;
            maxValue        0.0001;
            d               ( 7.5e-05 );
            n               ( 0.5 );
        }
    }
}

StandardWallInteractionCoeffs
{
    e               e [ 0 0 0 0 0 ] 1;
    mu              mu [ 0 0 0 0 0 ] 0;
}


// ************************************************************************* //
